zhujoe/esp8266/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <U8g2lib.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <EEPROM.h>
#include <Ticker.h>
#include <ESP8266mDNS.h>
#include "declaration_fun.h"

// 设定数据存储位置
#define EEPROM_INITADDR 0
#define EEPROM_SETUPNUMADDR 1
#define EEPROM_WIFIADDR 2

// U8G2_SSD1306_128X64_NONAME_F_SW_I2C u8g2(U8G2_R0, 12, 14);
U8G2_SSD1306_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, /* reset=*/U8X8_PIN_NONE, /* clock=*/12, /* data=*/14);

int onboardledPin = 2;
int enterVal, backVal, rightVal, leftVal;
uint8_t enterKey = 5;
uint8_t backKey = 4;
uint8_t rightKey = 13;
uint8_t leftKey = 0;

// ntp时间相关
int timezone = 8;
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "ntp1.aliyun.com", timezone * 3600, 60000);

// 自建web服务
ESP8266WebServer mcuserver(80);
char const *mDNSname = "setting";
bool serverflg = 0;

// 为多级菜单构建的结构体
struct Menu
{
  int index;
  int left;
  int right;
  int enter;
  int back;
  uint8_t *(*callback)();
};

// mqtt 远程服务器连接
char const *mqtt_server = "175.24.88.178"; //"192.168.31.127";
char const *itopic = "cube/dashboard";
WiFiClient espClient;
PubSubClient client(espClient);

// mqtt消息解释为未响应的超时时间（3s）[timenowEpoch-recmessagetime]
uint8_t intervalmessagetime = 3;
// 当前时间戳
int timenowEpoch = 0;
// mqtt消息接收时的时间戳
int recmessagetime = 0;
uint8_t nomessagesflag = 1;

// 树莓派传来的消息结构体
struct DashboardData
{
  int up_time;
  float cpu_percent;
  int cpu_current;
  float virtual_memory_free;
  float virtual_memory_total;
  float swap_memory_free;
  float swap_memory_total;
  float disk_usage_free;
  float disk_usage_percent;
  int cpu_temperature;
  int time_timestamp_cst;
  float net_speed_recv;
  float net_speed_sent;
  String remote_ip;
  String host_name;
  int tm_stamp_cst;
  int tm_year;
  int tm_mon;
  int tm_mday;
  int alert;
};
DashboardData currentData;

struct EepromData
{
  String init;
  String setupnum;
  String wifi_ssid;
  String wifi_password;
};
EepromData memoryData;

// 创建定时器（设备开启超过3s，不再计入短时间重启次数）
Ticker restclock;

// 额。。。。忘了干啥的了，想起来再补上
bool wifisetupflg = 1;

// 界面缓存
uint8_t *buf_arry;

// 启动智能配网
void ICACHE_FLASH_ATTR wifi_smartConfig()
{
  int wificonnum = 0;
  smartcfgPage_off();
  WiFi.mode(WIFI_STA);
  WiFi.beginSmartConfig();
  while (true)
  {
    delay(500);
    if (WiFi.smartConfigDone())
    {
      digitalWrite(onboardledPin, HIGH);
      delay(500);
      digitalWrite(onboardledPin, LOW);
      break;
    }
  }

  smartcfgPage_on();
  delay(1000);

  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    wificonnum++;
    if (wificonnum > 20)
    {
      EEPROM.write(EEPROM_INITADDR, 0);
      EEPROM.commit();
      u8g2.setFontDirection(0);
      wifiErrPage();
      u8g2.setFontDirection(1);
      delay(2000);
      ESP.restart();
    }
  }
  digitalWrite(onboardledPin, HIGH);
  wifisetupflg = 0;
}

// 获取配网中得到的wifi信息
String ICACHE_FLASH_ATTR wifi_smartConfigGetStr()
{
  String wificonfig = "";

  wificonfig += WiFi.SSID().c_str();
  memoryData.wifi_ssid = WiFi.SSID().c_str();
  wificonfig += " ";
  wificonfig += WiFi.psk().c_str();
  memoryData.wifi_password = WiFi.psk().c_str();

  return wificonfig;
}

// 从存储中读取wifi信息
void ICACHE_FLASH_ATTR wifi_eepromGetStr(int addr)
{
  String dataread;
  char *strlist[2];
  unsigned int y = 0;
  unsigned int i = 0;
  unsigned int endflg = 0;

  for (unsigned int i = 0; i < EEPROM.read(addr); i++)
  {
    dataread += char(EEPROM.read((addr + 1) + i));
  }
  for (unsigned x = 0; x < 2; x++)
  {
    strlist[x] = (char *)malloc(20 * sizeof(char));
  }
  for (i = 0; i < dataread.length(); i++, endflg++)
  {
    if (dataread[i] == ' ')
    {
      strlist[y][endflg] = '\0';
      endflg = 0;
      y++;
      i++;
    }
    strlist[y][endflg] = dataread[i];
  }
  strlist[y][endflg++] = '\0';
  memoryData.wifi_ssid = strlist[0];
  memoryData.wifi_password = strlist[1];
  for (unsigned x = 0; x < 2; x++)
  {
    free(strlist[x]);
  }
}

// 将wifi信息写入存储中固化
void ICACHE_FLASH_ATTR wifi_eepromPutStr(int addr, String datawritten)
{
  EEPROM.write(addr, datawritten.length());
  for (unsigned int i = 0; i < datawritten.length(); i++)
  {
    EEPROM.write((addr + 1) + i, datawritten[i]);
  }
  EEPROM.commit();
}

// 设备全新时的初始化
void ICACHE_FLASH_ATTR initdev()
{
  wifi_smartConfig();
  wifi_eepromPutStr(EEPROM_WIFIADDR, wifi_smartConfigGetStr());
  EEPROM.write(EEPROM_SETUPNUMADDR, 0);
  EEPROM.write(EEPROM_INITADDR, 1);
  EEPROM.commit();
}

// 定时器回调
void ICACHE_FLASH_ATTR clockCallback()
{
  EEPROM.write(EEPROM_SETUPNUMADDR, 0);
  EEPROM.commit();
}

// 连续（间隔不超过3s）开关电源，恢复设备初始化
void ICACHE_FLASH_ATTR restWifiConfig()
{
  EEPROM.write(EEPROM_SETUPNUMADDR, EEPROM.read(EEPROM_SETUPNUMADDR) + 1);
  EEPROM.commit();
  if (EEPROM.read(EEPROM_SETUPNUMADDR) < 3)
  {
    wifi_eepromGetStr(EEPROM_WIFIADDR);
    restclock.once(3, clockCallback);
  }
  else
  {
    initdev();
  }
}

void ICACHE_FLASH_ATTR initCurrentData()
{
  currentData.up_time = 0;
  currentData.cpu_percent = 0;
  currentData.cpu_temperature = -128;
  currentData.cpu_current = 0;
  currentData.disk_usage_free = 0;
  currentData.disk_usage_percent = 0;
  currentData.virtual_memory_free = 0;
  currentData.virtual_memory_total = 0;
  currentData.swap_memory_free = 0;
  currentData.swap_memory_total = 0;
  currentData.time_timestamp_cst = 0;
  currentData.net_speed_recv = 0;
  currentData.net_speed_sent = 0;
  currentData.remote_ip = "0.0.0.0";
  currentData.host_name = "null";
  currentData.tm_stamp_cst = 0;
  currentData.tm_year = 0;
  currentData.tm_mon = 0;
  currentData.tm_mday = 0;
  currentData.alert = 0;
};

// wifi连接
void ICACHE_FLASH_ATTR wifi_setup()
{
  int wificonnum = 0;

  WiFi.begin(memoryData.wifi_ssid, memoryData.wifi_password);
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    wificonnum++;
    if (wificonnum > 20)
    {
      EEPROM.write(EEPROM_INITADDR, 0);
      EEPROM.write(EEPROM_SETUPNUMADDR, 0);
      EEPROM.commit();
      u8g2.setFontDirection(0);
      wifiErrPage();
      u8g2.setFontDirection(1);
      delay(2000);
      ESP.restart();
    }
  }
  digitalWrite(onboardledPin, HIGH);
}

void ICACHE_FLASH_ATTR mqttCallback(char *topic, byte *payload, unsigned int length)
{
  recmessagetime = timeClient.getEpochTime();

  String jsonString = "";
  for (int i = 0; i < (int)length; i++)
  {
    jsonString += (char)payload[i];
  }
  DynamicJsonDocument doc((int)length * 4);
  DeserializationError err = deserializeJson(doc, jsonString);
  switch (err.code())
  {
  case DeserializationError::Ok:
    currentData.up_time = doc["up_time"];
    currentData.cpu_percent = doc["cpu_percent"];
    currentData.cpu_temperature = doc["cpu_temperature"];
    currentData.cpu_current = doc["cpu_freq"]["current"];
    currentData.time_timestamp_cst = doc["time"]["timestamp_cst"];
    currentData.virtual_memory_free = doc["virtual_memory"]["free"];
    currentData.virtual_memory_total = doc["virtual_memory"]["total"];
    currentData.swap_memory_free = doc["swap_memory"]["free"];
    currentData.swap_memory_total = doc["swap_memory"]["total"];
    currentData.disk_usage_free = doc["disk_usage"]["free"];
    currentData.disk_usage_percent = doc["disk_usage"]["percent"];
    currentData.net_speed_recv = doc["net_io_speed"]["recv"];
    currentData.net_speed_sent = doc["net_io_speed"]["sent"];
    currentData.remote_ip = (String)doc["ip"];
    currentData.host_name = (String)doc["host_name"];
    currentData.tm_stamp_cst = doc["time"]["timestamp_cst"];
    currentData.tm_year = doc["time"]["tm_year"];
    currentData.tm_mon = doc["time"]["tm_mon"];
    currentData.tm_mday = doc["time"]["tm_mday"];
    currentData.alert = doc["alert"];
    break;
  case DeserializationError::InvalidInput:
    break;
  case DeserializationError::NoMemory:
    break;
  default:
    break;
  }
}

// mqtt远程服务器注册（可用作掉网重连mqtt）
void ICACHE_FLASH_ATTR mqtt_reconnect()
{
  while (!client.connected())
  {
    String clientId = "ESP8266Client-";
    clientId += String(random(0xffff), HEX);
    if (client.connect(clientId.c_str()))
    {
      // client.publish(itopic, "hello world");
      client.subscribe(itopic);
      client.setBufferSize(2048);
    }
    else
    {
      // u8g2.sendBuffer();
      delay(3000);
    }
  }
}

void ICACHE_FLASH_ATTR headPage()
{
  // u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
  // u8g2.drawGlyph(0, 8, 123);
  u8g2.setFont(u8g2_font_artossans8_8n);
  u8g2.setCursor(8, 8);
  u8g2.print(timeClient.getFormattedTime());

  if (currentData.alert)
  {
    u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
    u8g2.drawGlyph(120, 8, 238); //cpu占用100%
  }

  if (nomessagesflag == 1)
  {
    u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
    u8g2.drawGlyph(110, 8, 197); // mqtt disconnect
  }
  else
  {
    u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
    u8g2.drawGlyph(110, 8, 198); // mqtt connect
  }

