zhujoe/esp8266/src/main.cpp
  u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
  u8g2.drawGlyph(100, 8, 248); // wifi

  if (currentData.net_speed_sent >= 0.01)
  {
    u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
    u8g2.drawGlyph(90, 8, 143); // updata
  }
  if (currentData.net_speed_recv >= 0.01)
  {
    u8g2.setFont(u8g2_font_open_iconic_all_1x_t);
    u8g2.drawGlyph(80, 8, 142); // download
  }
  u8g2.drawHLine(0, 9, 128);
}

uint8_t *ICACHE_FLASH_ATTR timePage()
{
  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_timB24_tn);
  u8g2.setCursor(0, 55);
  u8g2.print(timeClient.getFormattedTime());

  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR totalityPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_5x8_tr);
  u8g2.setCursor(netx, nety);
  u8g2.print("cpu_temperature   ");
  u8g2.print(currentData.cpu_temperature);
  u8g2.print("'C");
  nety += 9;

  u8g2.setCursor(netx, nety);
  u8g2.print("cpu_percent      ");
  u8g2.print(currentData.cpu_percent);
  u8g2.print("%");
  nety += 9;

  u8g2.setCursor(netx, nety);
  u8g2.print("net_recv         ");
  u8g2.print(currentData.net_speed_recv);
  u8g2.print("mb");
  nety += 9;

  u8g2.setCursor(netx, nety);
  u8g2.print("memory_free   ");
  // u8g2.print( (currentData.virtual_memory_free*100+0.05)/100 );
  u8g2.print(currentData.virtual_memory_free);
  u8g2.print("mb");
  nety += 9;

  u8g2.setCursor(netx, nety);
  u8g2.print("disk_free   ");
  u8g2.print(currentData.disk_usage_free);
  u8g2.print("mb");
  nety += 9;

  u8g2.setCursor(netx, nety);
  u8g2.print("disk_percent    ");
  u8g2.print(currentData.disk_usage_percent);
  u8g2.print("%");
  // nety += 9;

  // u8g2.setCursor(netx, nety);
  // u8g2.print("time_stamp  ");
  // u8g2.print(currentData.tm_stamp_cst);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8 *ICACHE_FLASH_ATTR uptimePage()
{
  int second = 0;
  int minute = 0;
  int hour = 0;
  uint8_t netx = 2;
  uint8_t nety = 18;

  second = currentData.up_time % 60;
  minute = currentData.up_time / 60 % 60;
  hour = currentData.up_time / 3600;
  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print(hour);
  u8g2.print("h ");
  u8g2.print(minute);
  u8g2.print("m ");
  u8g2.print(second);
  u8g2.print("s");

  u8g2.setCursor(2, 60);
  u8g2.setFont(u8g2_font_8x13_mf);
  u8g2.print("Up_time");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 123);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR cpuPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("temperature  ");
  u8g2.print(currentData.cpu_temperature);
  u8g2.print("'C");
  nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("percent ");
  u8g2.print(currentData.cpu_percent);
  u8g2.print("%");
  nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("current ");
  u8g2.print(currentData.cpu_current);
  u8g2.print("Mhz");

  u8g2.setCursor(2, 60);
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.print("Cpu");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 177);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR diskPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("free  ");
  u8g2.print(currentData.disk_usage_free);
  u8g2.print("mb");
  nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("percent  ");
  u8g2.print(currentData.disk_usage_percent);
  u8g2.print("%");
  nety += 11;

  u8g2.setCursor(2, 60);
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.print("Disk");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 171);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR memoryPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("v-total ");
  u8g2.print(currentData.virtual_memory_total);
  u8g2.print("mb");
  nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("v-free  ");
  u8g2.print(currentData.virtual_memory_free);
  u8g2.print("mb");
  nety += 11;

  // u8g2.setCursor(netx, nety);
  // u8g2.print("s-total ");
  // u8g2.print(currentData.swap_memory_total);
  // u8g2.print(" mb");
  // nety += 11;

  // u8g2.setCursor(netx, nety);
  // u8g2.print("s-free  ");
  // u8g2.print(currentData.swap_memory_free);
  // u8g2.print(" mb");

  u8g2.setCursor(2, 60);
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.print("Memory");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 139);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR networkPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("ip    ");
  u8g2.print(currentData.remote_ip);
  nety += 11;

  // u8g2.setCursor(netx, nety);
  // u8g2.print("name  ");
  // u8g2.print(currentData.host_name);
  // nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("recv  ");
  u8g2.print(currentData.net_speed_recv);
  u8g2.print("mb");
  nety += 11;

  u8g2.setCursor(netx, nety);
  u8g2.print("sent  ");
  u8g2.print(currentData.net_speed_sent);
  u8g2.print("mb");

  u8g2.setCursor(2, 60);
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.print("Network");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 194);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

void ICACHE_FLASH_ATTR noMessagesPage()
{
  uint8_t netx = 2;
  uint8_t nety = 11;

  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("no messages received!");
  nety += 11;
  u8g2.setCursor(netx, nety);
  u8g2.print("check mqtt server");

