zhujoe/esp8266/src/main.cpp
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Mqtt_Err");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 121);
  u8g2.sendBuffer();
}

uint8_t *ICACHE_FLASH_ATTR rebootPage()
{
  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Reboot");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 243);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR doreboot()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  client.publish(itopic, "reboot", 0);
  // u8g2.clearBuffer();
  headPage();
  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("success");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("reboot");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 120);
  // u8g2.sendBuffer();

  delay(2000);
  ESP.restart();
  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR shutdownPage()
{
  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Shutdown");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 235);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR doshutdown()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  client.publish(itopic, "shutdown", 0);
  // u8g2.clearBuffer();
  headPage();
  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("success");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Shutdown");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 120);
  // u8g2.sendBuffer();

  delay(2000);
  ESP.restart();
  return u8g2.getBufferPtr();
}

void ICACHE_FLASH_ATTR smartcfgPage_off()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  u8g2.clearBuffer();

  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Smartcfg");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 197);
  u8g2.sendBuffer();
}

void ICACHE_FLASH_ATTR smartcfgPage_on()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  u8g2.clearBuffer();

  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Smartcfg");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 198);
  u8g2.sendBuffer();
}

void ICACHE_FLASH_ATTR wifiErrPage()
{
  uint8_t netx = 2;
  uint8_t nety = 11;

  u8g2.clearBuffer();

  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("no Internet!");
  nety += 11;
  u8g2.setCursor(netx, nety);
  u8g2.print("check your wifi");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("wifi_err");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 121);
  u8g2.sendBuffer();
}

uint8_t *ICACHE_FLASH_ATTR serverPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  if (nomessagesflag == 1)
  {
    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.setCursor(netx, nety);
    u8g2.print("There is no terminal access");
  }

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Server");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 222);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

// 日历页面（正在施工中。。。。）
uint8_t *ICACHE_FLASH_ATTR datePage()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  // u8g2.clearBuffer();
  headPage();
  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Date");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 249);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

// 提醒页面(正在施工中。。。。)
uint8_t *ICACHE_FLASH_ATTR notePage()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  // u8g2.clearBuffer();
  headPage();
  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("NotePad");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 257);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

// 生命剩余时间(正在施工中。。。。)
uint8_t *ICACHE_FLASH_ATTR lifePage()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  // u8g2.clearBuffer();
  headPage();
  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Life");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 98);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

// 倒计时页面（正在施工中。。。。）
uint8_t *ICACHE_FLASH_ATTR countDownPage()
{
  // uint8_t netx = 2;
  // uint8_t nety = 17;

  // u8g2.clearBuffer();
  headPage();
  // u8g2.setFont(u8g2_font_6x10_tf);
  // u8g2.setCursor(netx, nety);
  // u8g2.print("instruction");

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Countdown");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 269);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

// 对树莓派进行简单的操作，无论树莓派什么反应，都会重启本设备（逻辑有点问题，有待优化）
uint8_t *ICACHE_FLASH_ATTR controlPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();

  if (nomessagesflag == 1)
  {
    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.setCursor(netx, nety);
    u8g2.print("There is no terminal access");
  }

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Control");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 265);
  // u8g2.sendBuffer();

