zhujoe/esp8266/src/main.cpp
  return u8g2.getBufferPtr();
}

// 树莓派音量调节(正在施工中。。。。)
uint8_t *ICACHE_FLASH_ATTR volumePage()
{
  // u8g2.clearBuffer();
  headPage();
  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Volume");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 105);
  // u8g2.sendBuffer();

  return u8g2.getBufferPtr();
}

uint8_t *ICACHE_FLASH_ATTR settingPage()
{
  // u8g2.clearBuffer();
  headPage();

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Setting");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 129);
  // u8g2.sendBuffer();
  if (serverflg)
  {
    serverflg = 0;
    mcuserver.stop();
    // MDNS.close();
  }

  return u8g2.getBufferPtr();
}

// web服务相关
void ICACHE_FLASH_ATTR serverHomePage()
{
  mcuserver.send(200, "text/plain", "test homepage !");
}

// 启动web服务，进行网页端的设置（正在施工中。。。。）
uint8_t *ICACHE_FLASH_ATTR doSettingPage()
{
  uint8_t netx = 2;
  uint8_t nety = 18;

  // u8g2.clearBuffer();
  headPage();
  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.setCursor(netx, nety);
  u8g2.print("local ");
  u8g2.print(WiFi.localIP());
  // nety += 11;

  u8g2.setFont(u8g2_font_8x13_tf);
  u8g2.setCursor(2, 60);
  u8g2.print("Setting");

  u8g2.setFont(u8g2_font_open_iconic_all_4x_t);
  u8g2.drawGlyph(95, 62, 120);
  // u8g2.sendBuffer();

  if (serverflg == 0)
  {
    MDNS.begin(mDNSname);
    mcuserver.on("/", serverHomePage);
    mcuserver.begin();
    serverflg = 1;
  }

  return u8g2.getBufferPtr();
}

// 省电模式初探
// void ICACHE_FLASH_ATTR light_sleep()
// {
//   wifi_station_disconnect();
//   wifi_set_opmode_current(NULL_MODE);
//   wifi_fpm_set_sleep_type(LIGHT_SLEEP_T);
//   wifi_fpm_open();
//   gpio_pin_wakeup_enable(GPIO_ID_PIN(5), GPIO_PIN_INTR_LOLEVEL);
//   wifi_fpm_do_sleep(0xFFFFFFF);
//   u8g2.setPowerSave(1);
// }

// 手动归零显示缓冲区
void ICACHE_FLASH_ATTR zeroScreenBuf(uint8_t *page)
{
  uint8_t i, n;
  for (i = 1; i < 8; i++)
  {
    for (n = 0; n < 128; n++)
    {
      page[n + i * 128] = 0x00;
    }
  }
}

//页面横向下->返回动画
void ICACHE_FLASH_ATTR switchPagesDown(uint8_t page1[1024], uint8_t page2[1024])
{
  uint8_t *screenbuf;

  u8g2.clearBuffer();
  headPage();
  screenbuf = u8g2.getBufferPtr();

  zeroScreenBuf(screenbuf);

  // 7/1=7 动画完成需要移动7次（可调节）

  // 列控制
  for (int i = 1; i < 8; i++)
  {
    // 行控制
    for (int k = 0; k < 128; k++)
    {
      for (int first = i + 1; first < 8; first++)
      {
        screenbuf[first * 128 + k] = page1[(first - i) * 128 + k];
      }
      for (int second = 1; second <= i; second++)
      {
        screenbuf[second * 128 + k] = page2[(second + 7 - i) * 128 + k];
      }
    }
    u8g2.sendBuffer();
    ESP.wdtFeed();
    delay(15);
  }
}

//页面横向上->确认动画
void ICACHE_FLASH_ATTR switchPagesUp(uint8_t page1[1024], uint8_t page2[1024])
{
  uint8_t *screenbuf;

  u8g2.clearBuffer();
  headPage();
  screenbuf = u8g2.getBufferPtr();

  zeroScreenBuf(screenbuf);

  // 7/1=7 动画完成需要移动7次（可调节）

  // 列控制
  for (int i = 1; i < 8; i++)
  {
    // 行控制
    for (int k = 0; k < 128; k++)
    {
      for (int first = i + 1; first < 8; first++)
      {
        screenbuf[(first - i) * 128 + k] = page1[first * 128 + k];
      }
      for (int second = 1; second <= i; second++)
      {
        screenbuf[(second + 7 - i) * 128 + k] = page2[second * 128 + k];
      }
    }
    u8g2.sendBuffer();
    ESP.wdtFeed();
    delay(15);
  }
}

//页面横向左->切换动画
void ICACHE_FLASH_ATTR switchPagesL(uint8_t page1[1024], uint8_t page2[1024])
{
  uint8_t *screenbuf;

  u8g2.clearBuffer();
  headPage();
  screenbuf = u8g2.getBufferPtr();

  zeroScreenBuf(screenbuf);

  // 128/8=16 动画完成需要移动16次（可调节）
  // 行控制
  for (int k = 0; k < 128; k += 8)
  {
    // 列控制
    for (int i = 1; i < 8; i++)
    {
      for (int first = 0; first < 128 - k; first++)
      {
        screenbuf[i * 128 + first + k] = page1[i * 128 + first];
      }
      for (int second = 128 - k; second < 128; second++)
      {
        screenbuf[i * 128 + second - 127 + k] = page2[i * 128 + second];
      }
    }
    u8g2.sendBuffer();
    ESP.wdtFeed();
    delay(7);
  }
}

// 页面横向右->切换动画
void ICACHE_FLASH_ATTR switchPagesR(uint8_t page1[1024], uint8_t page2[1024])
{
  uint8_t *screenbuf;

  u8g2.clearBuffer();
  headPage();
  screenbuf = u8g2.getBufferPtr();

  zeroScreenBuf(screenbuf);

  // 128/8=16 动画完成需要移动16次（可调节）
  // 行控制
  for (int k = 0; k < 128; k += 8)
  {
    // 列控制
    for (int i = 1; i < 8; i++)
    {
      for (int first = k; first < 128; first++)
      {
        screenbuf[i * 128 + first - k] = page1[i * 128 + first];
      }
      for (int second = 0; second < k; second++)
      {
        screenbuf[i * 128 + 127 - k + second] = page2[i * 128 + second];
      }
    }
    u8g2.sendBuffer();
    ESP.wdtFeed();
    delay(7);
  }
}

// 多级菜单的结构层次，跳转逻辑（有待优化）
Menu menu[21] = {
    //---------time-----------
    {0, 18, 4, 1, 0, timePage},
    {1, 3, 2, 1, 0, countDownPage},
    {2, 1, 3, 2, 0, datePage},
    {3, 2, 1, 3, 0, lifePage},
    //---------server----------
    {4, 0, 17, 5, 4, serverPage},
    {5, 11, 6, 5, 4, totalityPage},
    {6, 5, 7, 6, 4, cpuPage},
    {7, 6, 8, 7, 4, diskPage},
    {8, 7, 9, 8, 4, memoryPage},
    {9, 8, 10, 9, 4, networkPage},
    {10, 9, 11, 10, 4, uptimePage},
    //-------server_control-------
    {11, 10, 5, 12, 4, controlPage},
    {12, 16, 14, 13, 11, rebootPage},
    {13, 13, 13, 13, 13, doreboot},
    {14, 12, 16, 15, 11, shutdownPage},
    {15, 15, 15, 15, 15, doshutdown},
    {16, 14, 12, 16, 11, volumePage},
    //---------note----------
    {17, 4, 18, 17, 17, notePage},
    //--------setting----------
    {18, 17, 0, 19, 18, settingPage},
    {19, 19, 19, 19, 18, doSettingPage},
    //--------other status-----
    // {20, 20, 20, 20, 20, noMessagesPage},

};
uint8_t *(*operation_index)();
int func_index = 0;
uint8_t first_screen[1024];
uint8_t second_screen[1024];

// 入口程序，arduino对 main() 进行了封装，只执行一次
void setup()
{
  // 打开串口输出（没怎么用，有待详细化）
  Serial.begin(115200);
  pinMode(onboardledPin, OUTPUT);
  digitalWrite(onboardledPin, LOW);

  ESP.wdtEnable(WDTO_2S);
  EEPROM.begin(1024);
  u8g2.setBusClock(1000000);
  u8g2.begin();

  Serial.println(EEPROM.read(EEPROM_INITADDR));
  Serial.println(EEPROM.read(EEPROM_SETUPNUMADDR));

  if (EEPROM.read(EEPROM_INITADDR) != 1)
  {
    initdev();
  }
  else
  {
    restWifiConfig();
  }

  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_open_iconic_all_6x_t);
  u8g2.drawGlyph(40, 48, 97);
  u8g2.drawRFrame(30, 54, 68, 6, 2);
  u8g2.sendBuffer();

  pinMode(enterKey, INPUT_PULLUP);
  pinMode(backKey, INPUT_PULLUP);
  pinMode(rightKey, INPUT_PULLUP);
  pinMode(leftKey, INPUT_PULLUP);

