zhujoe/esp8266/src/main.cpp
  u8g2.setFont(u8g2_font_baby_tf);
  u8g2.setFontDirection(1);

  randomSeed(micros()); //
  Serial.println("I'm here!!!");
  u8g2.drawRBox(30, 54, 10, 6, 2);
  u8g2.drawStr(0, 0, "wifi");
  u8g2.sendBuffer();

  // 忘了为什么这么写了（想起来了补上）
  if (wifisetupflg)
  {
    wifi_setup(); //
    u8g2.drawRBox(30, 54, 20, 6, 2);
    u8g2.setDrawColor(0);
    u8g2.drawBox(0, 0, 6, 60);
    u8g2.setDrawColor(1);
    u8g2.drawStr(0, 0, "client_set");
    u8g2.sendBuffer();
  }

  client.setServer(mqtt_server, 1883); //
  client.setCallback(mqttCallback);    //
  u8g2.drawRBox(30, 54, 40, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "time_set");
  u8g2.sendBuffer();

  timeClient.begin(); //
  u8g2.drawRBox(30, 54, 48, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "time_update");
  u8g2.sendBuffer();

  timeClient.update(); //
  u8g2.drawRBox(30, 54, 56, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "mqtt");
  u8g2.sendBuffer();

  mqtt_reconnect(); //
  client.loop();    //
  u8g2.drawRBox(30, 54, 63, 6, 2);
  u8g2.setDrawColor(0);
  u8g2.drawBox(0, 0, 6, 60);
  u8g2.setDrawColor(1);
  u8g2.drawStr(0, 0, "ready");
  u8g2.sendBuffer();

  u8g2.drawRBox(30, 54, 68, 6, 2);
  u8g2.sendBuffer();

  // recmessagetime = timeClient.getEpochTime();
  // recmessagetime = 0;
  u8g2.setFontDirection(0);
}

void loop()
{
  // wifi连接异常处理
  while (WiFi.status() != WL_CONNECTED)
  {
    wifiErrPage();
    delay(500);
  }

  // mqtt远程服务器异常处理
  if (!client.connected())
  {
    noMessagesPage();
    mqtt_reconnect();
  }
  client.loop();

  // web服务相关
  if (serverflg)
  {
    mcuserver.handleClient();
  }

  enterVal = digitalRead(enterKey);
  backVal = digitalRead(backKey);
  leftVal = digitalRead(leftKey);
  rightVal = digitalRead(rightKey);

  // 长时间未收到消息，视为mqtt消息异常
  nomessagesflag = 0;
  timenowEpoch = timeClient.getEpochTime();
  if (timenowEpoch - recmessagetime > intervalmessagetime)
  {
    nomessagesflag = 1;
  }

  if ((enterVal == LOW) || (backVal == LOW) || (leftVal == LOW) || (rightVal == LOW))
  {
    delay(5);
    if (enterVal == LOW)
    {
      while (!enterVal)
      {
        ESP.wdtFeed();
        enterVal = digitalRead(enterKey);
        operation_index = menu[func_index].callback;
        u8g2.clearBuffer();
        buf_arry = (*operation_index)();
        u8g2.sendBuffer();
      }
      if (func_index != menu[func_index].enter)
      {
        zeroScreenBuf(first_screen);
        for (int a = 0; a < 1024; a++)
        {
          first_screen[a] = buf_arry[a];
        }
        u8g2.clearBuffer();

        func_index = menu[func_index].enter;
        operation_index = menu[func_index].callback;
        buf_arry = (*operation_index)();
        zeroScreenBuf(second_screen);
        for (int a = 0; a < 1024; a++)
        {
          second_screen[a] = buf_arry[a];
        }
        switchPagesUp(first_screen, second_screen);
      }
    }

    if (backVal == LOW)
    {
      while (!backVal)
      {
        ESP.wdtFeed();
        backVal = digitalRead(backKey);
        operation_index = menu[func_index].callback;
        u8g2.clearBuffer();
        buf_arry = (*operation_index)();
        u8g2.sendBuffer();
      }
      if (func_index != menu[func_index].back)
      {
        zeroScreenBuf(first_screen);
        for (int a = 0; a < 1024; a++)
        {
          first_screen[a] = buf_arry[a];
        }
        u8g2.clearBuffer();

        func_index = menu[func_index].back;
        operation_index = menu[func_index].callback;
        buf_arry = (*operation_index)();
        zeroScreenBuf(second_screen);
        for (int a = 0; a < 1024; a++)
        {
          second_screen[a] = buf_arry[a];
        }
        switchPagesDown(first_screen, second_screen);
      }
    }
    if (leftVal == LOW)
    {
      while (!leftVal)
      {
        ESP.wdtFeed();
        leftVal = digitalRead(leftKey);
        operation_index = menu[func_index].callback;
        u8g2.clearBuffer();
        buf_arry = (*operation_index)();
        u8g2.sendBuffer();
      }
      if (func_index != menu[func_index].left)
      {
        zeroScreenBuf(first_screen);
        for (int a = 0; a < 1024; a++)
        {
          first_screen[a] = buf_arry[a];
        }
        u8g2.clearBuffer();
        func_index = menu[func_index].left;
        operation_index = menu[func_index].callback;
        buf_arry = (*operation_index)();
        zeroScreenBuf(second_screen);
        for (int a = 0; a < 1024; a++)
        {
          second_screen[a] = buf_arry[a];
        }
        switchPagesL(first_screen, second_screen);
      }
    }
    if (rightVal == LOW)
    {
      while (!rightVal)
      {
        ESP.wdtFeed();
        rightVal = digitalRead(rightKey);
        operation_index = menu[func_index].callback;
        u8g2.clearBuffer();
        buf_arry = (*operation_index)();
        u8g2.sendBuffer();
      }
      if (func_index != menu[func_index].right)
      {
        zeroScreenBuf(first_screen);
        for (int a = 0; a < 1024; a++)
        {
          first_screen[a] = buf_arry[a];
        }
        u8g2.clearBuffer();
        func_index = menu[func_index].right;
        operation_index = menu[func_index].callback;
        buf_arry = (*operation_index)();
        zeroScreenBuf(second_screen);
        for (int a = 0; a < 1024; a++)
        {
          second_screen[a] = buf_arry[a];
        }
        switchPagesR(first_screen, second_screen);
      }
    }
  }

  ESP.wdtFeed();
  operation_index = menu[func_index].callback;
  u8g2.clearBuffer();
  (*operation_index)();
  u8g2.sendBuffer();
}